# NoRisersInPureMonolithicStairs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..NoRisersInPureMonolithicStairs Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Monolithic Stairs with zero tread thickness can't have risers
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoRisersInPureMonolithicStairs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoRisersInPureMonolithicStairs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoRisersInPureMonolithicStairs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace